tap "ailabstw/ceph-fuse"
tap "candid82/brew"
tap "daipeihust/tap"
tap "dash2701/dash2701"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "modularml/packages"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "robusta-dev/krr"
tap "yqrashawn/goku"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Opinionated way of installing Argo CD and managing GitOps repositories
brew "argocd-autopilot"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Core application library for C
brew "glib"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Like cURL, but for gRPC
brew "grpcurl"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Hash utilities
brew "md5sha1sum", link: false
# Run a Kubernetes cluster locally
brew "minikube"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Port scanning utility for large networks
brew "nmap"
# Package for scientific computing with Python
brew "numpy"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Shell command parallelization utility
brew "parallel"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image processing library
brew "vips"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
brew "dash2701/dash2701/chatgptdash"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Modular developer CLI tool
brew "modularml/packages/modular"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# Kubernetes Resource Recommender by Robusta
brew "robusta-dev/krr/krr"
# karabiner configurator
brew "yqrashawn/goku/goku"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Productivity app
cask "dropzone"
cask "font-hack-nerd-font"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Active space menu bar icon
cask "whichspace"
