tap "candid82/brew"
tap "daipeihust/tap"
tap "dash2701/dash2701"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "modularml/packages"
tap "yqrashawn/goku"
# ChatGPT cli
brew "aichat"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Opinionated way of installing Argo CD and managing GitOps repositories
brew "argocd-autopilot"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Console Matrix
brew "cmatrix"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Open source suite of directory software
brew "openldap"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Like cURL, but for gRPC
brew "grpcurl"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Hash utilities
brew "md5sha1sum"
# Run a Kubernetes cluster locally
brew "minikube"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Shell command parallelization utility
brew "parallel"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
brew "dash2701/dash2701/chatgptdash"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Modular developer CLI tool
brew "modularml/packages/modular"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Tool to hide status bar icons
cask "dozer"
# Productivity app
cask "dropzone"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
