# Generated like this 
# {
#  brew list --installed-on-request --full-name --formula | sed 's/^/brew "/;s/$/"/'
#  brew list --cask --full-name | sed 's/^/cask "/;s/$/"/'
# } > Brewfile

brew "dockutil"
brew "fzf"
brew "mise"
brew "starship"
brew "stow"
brew "antidote"
brew "tmux"
brew "zoxide"
brew "yqrashawn/goku/goku"
brew "ffmpeg"

cask "claude"
cask "dropzone"
cask "ghostty"
cask "raycast"
cask "obsidian"
cask "ticktick"
cask "spotify"
cask "karabiner-elements"
cask "nikitabobko/tap/aerospace"
