tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Bare libuv bindings for lua
brew "luv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Manage compile and link flags for libraries
brew "pkg-config"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
brew "sshpass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# General-purpose data compression with high compression ratio
brew "xz"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
