tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "warrensbox/tap"

# Command-line tools
brew "tcptraceroute"
brew "htop"
brew "tree"
brew "watch"
brew "mtr"
brew "stow"
brew "jq"
brew "fzf"

# Bitwarden CLI
brew "bitwarden-cli"

# Programming
brew "node"
brew "go"
brew "jenv"
brew "maven"
brew "pyenv"

# Neovim
brew "neovim"

# Terraform
brew "terragrunt"
brew "tflint"
brew "tfswitch"
